# Напишите программу, которая вырезает значения между кавычками (двойными и
# одинарными) в строке и выводит их на экран в виде списка без самих кавычек.
# Например, 'Современные языки программирования, такие как: "Python", "PHP",
# "Java", а так же уже устаревший 'Assembler' и т.д.' -> [‘Python’, ‘PHP’, ‘Java’].

import re

string = ('Современные языки программирования, такие как: "Python", "PHP", '
          '"Java", а так же уже устаревшие \'Assembler\' и т.д.')

words = re.findall(r"(\"\w+\"|\'\w+\')", string)

print(words)