# 1. Напишите программу, которая принимает список чисел от пользователя и передает его в функцию modify_list,
# которая изменяет элементы списка. Функция должна умножить нечетные числа на 2, а четные числа разделить на 2.
# Выведите измененный список на экран. Объясните, почему изменения происходят только внутри функции и как работают
# изменяемые и неизменяемые параметры.
# Пример вывода:
# Введите список чисел, разделенных пробелами: 1 2 3 4 5
#
# Измененный список чисел: [2, 1, 6, 2, 10]

def modify_list(orig_list):
    for i in range(len(orig_list)):
        orig_list[i] = orig_list[i] // 2 if orig_list[i] % 2 == 0 else orig_list[i] * 2


string = input("Enter the numbers separated by comma: ")

numbers = [int(i) for i in string.split(" ")]
modify_list(numbers)

print("Modified list of numbers: ", numbers)

# Объясните, почему изменения происходят только внутри функции и как работают
# изменяемые и неизменяемые параметры.
# ----------------------------------------------------------------------------------------------------------------------
# ОТВЕТ: мы используем тип list, который является изменяемым типом данных. Это значит, что мы можем изменять
# элементы(части) объекта, но адрес ячейки в памяти этого объекта остается таким же.
# Неизменяемые же типы данных меняют адрес своей ячейки в памяти при какой либо модификации
# (например при конкатенация строк или при увеличении инт числа).
# Таким образом, наша функция не! возвращает измененный лист и мы не! присваиваем измененный лист какой-либо переменной,
# а функция меняет элементы уже существующего листа налету. Поэтому в строке 18 мы вызываем функцию, которая выполняет
# модификацию уже существующего листа. В самой функции (строка 12) мы переназначаем элемент в листе по индексу.

