# 1. Дано предложение и количество раз которое его надо повторить. Напишите
# программу, которая повторяет данное предложение нужное количество раз.
# Формат входных данных:
# В первой строке записано текстовое предложение, во второй — количество
# повторений.
# Формат выходных данных:
# Программа должна вывести указанное текстовое предложение нужное
# количество раз. Каждое повторение должно начинаться с новой строки.

string = input("Enter your text: ")
repeat = int(input('How many times: '))

for _ in range(repeat):
    print(string)

# print((string + "\n")*repeat)





