import math
# Изначально создавал дополнительно переменную Pi = 3.14159 и подставлял вместо math.pi далее в расчетах,
# т.к. предполагалось не использовать какие-либо доп. библиотеки.
# Но результаты вычислений были отличными от примера в задании (не значительно, но всё же),
# поэтому решил импортировать библиотеку для возможности использования библиотечной константы Pi

radius = float(input("Введите радиус окружности: "))

circumference = 2 * math.pi * radius
area = math.pi * radius ** 2

print("Длина окружности: ", circumference)
print("Площадь окружности: ", area)
