# Дана последовательность слов. Написать функцию, которая возвращает
# последовательность слов из исходной последовательности, длина которых
# больше трех. Использовать lambda-функции и filter.

w_list = ["cat", "no", "level", "names", "is"]

print(list(filter(lambda x: len(x) > 3, w_list)))
