# 2. Напишите программу, которая принимает строку от пользователя и разбивает ее на отдельные слова.
# Затем программа должна создать новый кортеж, содержащий длину каждого слова в исходной строке.
# Используйте методы строк и кортежей для обработки данных.
# Пример вывода:
#
# Введите предложение: Программирование это интересно и полезно
#
# Длины слов в предложении: (15, 3, 8, 2, 6)

string = input('Enter a string: ').split()

word_len_list = []

for word in string:
    word_len_list.append(len(word))

print("Words lengths in the sentence is: ", tuple(word_len_list))
