# 1. Напишите программу, которая принимает строку от пользователя и разбивает ее на отдельные слова. Затем программа должна объединить слова в обратном порядке с использованием метода join(). Используйте динамический массив и методы для работы со строками. Выведите результат на экран с помощью команды print.
# Пример вывода:
#
# Введите предложение: Программирование это интересно и полезно
#
# Перевернутое предложение: полезно и интересно это Программирование

# string = input("enter string: ").split()
# string.reverse()
# reversed_string = " ".join(string)
#
# print(reversed_string)

string = input("enter string: ")
print(" ".join(reversed(string.split())))
